Autodesk.Revit.DB.ElementParameterFilter.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.FilterRule},System.Boolean)
Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing the given filter rules.
filterRules:
The rules applied to test if the element passes this filter.
inverted:
True if the filter should match all elements which do not pass the filter rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The filterRules array is empty or invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementParameterFilter.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.FilterRule})
Constructs a new instance of an ElementParameterFilter from a set of rules.
filterRules:
The rules applied to test if the element passes this filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The filterRules array is empty or invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementParameterFilter.#ctor(Autodesk.Revit.DB.FilterRule,System.Boolean)
Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule.
filterRule:
The rule applied to test if the element passes this filter.
inverted:
True if the filter should match all elements which do not pass the filter rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementParameterFilter.#ctor(Autodesk.Revit.DB.FilterRule)
Constructs a new instance of an ElementParameterFilter from a single rule.
filterRule:
The rule applied to test if the element passes this filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011